apim-migration-testing-tool-rest-assured/RESTAssuredAutomation/src/test/payloads/revokeAuthApplicationRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:getAllOAuthApplicationData/>
   </soapenv:Body>
</soapenv:Envelope>